from telegram import InlineKeyboardButton, InlineKeyboardMarkup


def support_text():

    return """
🤝 حمایت از اندیشکده مدیریت و بازار

اگر محتوای آموزشی اندیشکده برای شما مفید بوده،
می‌توانید با حمایت خود به ادامه و توسعه این پروژه کمک کنید. 💙

━━━━━━━━━━━━━━━━━━

📚 حمایت شما به توسعه این بخش‌ها کمک می‌کند:

📝 توسعه بانک سوالات
📖 تولید درسنامه و منابع آموزشی
🎓 توسعه آزمون‌های استخدامی
🧠 توسعه بخش روانشناسی و مددکاری
💻 توسعه و بهبود ربات
🚀 اضافه شدن امکانات آموزشی جدید

━━━━━━━━━━━━━━━━━━

💳 حمایت از طریق کارت به کارت

شماره کارت:

{6219861875458621}

به نام:

{علی سجادی}

━━━━━━━━━━━━━━━━━━

💳 پرداخت آنلاین

🚧 درگاه پرداخت در حال حاضر غیرفعال است.

━━━━━━━━━━━━━━━━━━

🙏 از حمایت و همراهی شما سپاسگزاریم.

🏛️ اندیشکده مدیریت و بازار

دانش برای یادگیری، مهارت و پیشرفت
"""


def support_menu():

    keyboard = [

        [
            InlineKeyboardButton(
                "🔙 منوی اصلی",
                callback_data="home"
            )
        ]

    ]

    return InlineKeyboardMarkup(keyboard)
